Repository: Dfortysix/math_clash
Catalog: lib/l10n/app_*.arb
Languages: vi

source: Solo Mode
vi: Chế độ Solo

source: Create PvP Room
vi: Tạo phòng PvP

source: Join PvP Room
vi: Tham gia phòng PvP

source: Quick Match
vi: Ghép trực tuyến

source: Leaderboard
vi: Bảng Xếp Hạng

# signInGoogle
source: Sign in with Google
vi: Đăng nhập Google

# signOutGoogle
source: Sign out from Google
vi: Đăng xuất Google

# turnOffMusic
source: Turn off background music
vi: Tắt nhạc nền

# turnOnMusic
source: Turn on background music
vi: Mở nhạc nền

# soloModeDescription
source: Answer 15 math questions The faster you answer, the more points you get!
vi: Trả lời 15 câu hỏi toán học Càng nhanh càng được nhiều điểm!

# signInToSaveScore
source: Sign in with Google to save your score to the leaderboard
vi: Đăng nhập Google để lưu điểm vào bảng xếp hạng

source: Start
vi: Bắt đầu

source: Question
vi: Câu hỏi

source: Score
vi: Điểm

# timeRemaining
source: Time: {seconds}s
vi: Thời gian: {seconds}s

source: Game completed!
vi: Bạn đã hoàn thành!

# yourScore
source: Your score: {score}
vi: Số điểm: {score}

# signInToSave
source: Sign in to save score
vi: Đăng nhập để lưu điểm

# scoreNotSaved
source: Score will not be saved to leaderboard
vi: Điểm số sẽ không được lưu vào bảng xếp hạng

source: Close
vi: Đóng

source: Play Again
vi: Chơi lại

source: Back to Menu
vi: Về menu

source: Room Code
vi: Mã phòng

source: Copy room code
vi: Sao chép mã phòng

source: Room code copied!
vi: Đã sao chép mã phòng!

source: Start Game
vi: Bắt đầu game

# waitingForPlayers
source: Waiting for other players...
vi: Đang chờ người chơi khác...

# enterRoomCode
source: Enter room code to join
vi: Nhập mã phòng để tham gia

source: Please enter room code
vi: Vui lòng nhập mã phòng

# needGoogleSignIn
source: You need to sign in with Google
vi: Bạn cần đăng nhập Google

source: Cannot join room
vi: Không thể tham gia phòng

source: Leave Room
vi: Rời phòng

source: Feature in development!
vi: Chức năng đang phát triển!

source: Error
vi: Lỗi

source: Try Again
vi: Thử lại

# noLeaderboardData
source: No leaderboard data available
vi: Chưa có dữ liệu xếp hạng

source: Not signed in
vi: Chưa đăng nhập

# signInToSaveLeaderboard
source: Sign in with Google to save score to leaderboard
vi: Đăng nhập Google để lưu điểm vào bảng xếp hạng

source: PvP Mode
vi: Chế độ PvP

# soundError
source: Sound playback error
vi: Lỗi phát âm thanh

source: Settings
vi: Cài đặt

source: Language
vi: Ngôn ngữ

source: About
vi: Giới thiệu

# appDescription
source: Math Clash - A fun math game!
vi: Math Clash - Trò chơi toán học vui nhộn!

source: Language changed!
vi: Đã đổi ngôn ngữ!

source: Join
vi: Tham gia

source: Saving score...
vi: Đang lưu điểm...

source: You
vi: Bạn

source: Waiting
vi: Chờ người chơi

source: Playing
vi: Đang chơi

source: Finished
vi: Đã kết thúc

source: Unknown
vi: Không xác định

# leaveRoomConfirm
source: Are you sure you want to leave the room?
vi: Bạn có chắc muốn rời phòng?

source: Cancel
vi: Hủy

source: Leaving room...
vi: Đang rời phòng...

# leaveRoomError
source: An error occurred while leaving the room
vi: Có lỗi xảy ra khi rời phòng

source: Creating room...
vi: Đang tạo phòng...

# pleaseSignInGoogle
source: Please sign in with Google to save score
vi: Vui lòng đăng nhập bằng Google để lưu điểm

source: Error saving score
vi: Lỗi khi lưu điểm

# roomNotExists
source: Room does not exist!
vi: Phòng không tồn tại!

# roomFull
source: Room is full!
vi: Phòng đã đủ người!

# googleSignInTimeout
source: Google sign in timeout, please try again!
vi: Đăng nhập Google quá lâu, vui lòng thử lại!

# errorGoogleSignIn
source: Error signing in with Google
vi: Lỗi khi đăng nhập Google

# errorGoogleSignOut
source: Error signing out
vi: Lỗi khi đăng xuất

source: Players
vi: Người chơi

source: Players in room
vi: Người chơi trong phòng

source: Signed in
vi: Đã đăng nhập

source: Room Host
vi: Chủ phòng
